sentervip/stm32f103-bootloader-Demo/stm32f105rb-IAP/pixelplus_stm32/PI5008K/pi5008k_func.c
#include "..\common\board.h"
#include "..\common\common.h"
#include <stdio.h>
#include "stm32f10x.h"
#include "..\Common\i2c.h"
#include "pi5008k_test.h"
#include "pi5008k_remocon.h"
#include "AppCan.h"
#include "pi5008k_func.h"
#include "AppIO.h"
#include <stdlib.h>     //NULL pointer definition
#include <stdarg.h>     // (...) parameter handling
#include <ctype.h>
#include <string.h>

#define CMD_PROMPT      ">>"
static int vfprintf_(void (*putc)(char), const char* str,  va_list arp);

int pi5008k_usart1_buffer_cnt;
int pi5008k_usart2_buffer_cnt;
char pi5008k_usart1_get_buffer[PI5008K_USART_BUFFER_SIZE];
char pi5008k_usart2_get_buffer[PI5008K_USART_BUFFER_SIZE];
char pi5008k_usart1_get_cmd[PI5008K_USART_BUFFER_SIZE];
char pi5008k_usart2_get_cmd[PI5008K_USART_BUFFER_SIZE];
char pi5008k_usart1_get_cmd_arg[20][20];
char pi5008k_usart2_get_cmd_arg[20][20];
int pi5008k_usart1_arg_div_point_cnt;
int pi5008k_usart2_arg_div_point_cnt;
int pi5008k_usart_arg_cnt_for_test;
char pi5008k_usart1_get_cmd_arg_div_point[20];// cmd arguments number
char pi5008k_usart2_get_cmd_arg_div_point[20];// cmd arguments number
unsigned int pi5008k_usart1_cmd_exist_flag; //exist flag
unsigned int pi5008k_usart2_cmd_exist_flag; //exist flag
static char gTempCmdBuffer1[PI5008K_USART_BUFFER_SIZE];
static char gTempCmdBuffer2[PI5008K_USART_BUFFER_SIZE];

//extern uint8_t KeyNumber;
//extern CanTxMsg TxMessage;



extern uint32_t g_old_KeyVal;
extern uint32_t g_start_key_tim ;
extern uint32_t g_long_key_flag;
extern uint32_t g_input_key_flag;
extern uint32_t g_repeat_cnt;
extern uint32_t g_repeat_cnt_prv;

extern int g_center_key_flag;


#define IR_KEY_REPEAT_TERM		12000



void PutUart1Con(char ch) 
{
        if(ch == '\n')
        {   
                USART_SendData(USART1, (char) '\r');

                while(USART_GetFlagStatus(USART1, USART_FLAG_TC) == RESET) { } 
        }   

        USART_SendData(USART1, (char) ch);

        while(USART_GetFlagStatus(USART1, USART_FLAG_TC) == RESET) { } 
}
void PutUart2Con(char ch) 
{
        if(ch == '\n')
        {   
                USART_SendData(USART2, (char) '\r');

                while(USART_GetFlagStatus(USART1, USART_FLAG_TC) == RESET) { } 
        }   

        USART_SendData(USART2, (char) ch);

        while(USART_GetFlagStatus(USART2, USART_FLAG_TC) == RESET) { } 
}

void UART1_PRINTF(const char *format, ...)
{
	va_list arg;

	va_start(arg, format);
	vfprintf_((&PutUart1Con), format, arg);
	va_end(arg);
}
void UART2_PRINTF(const char *format, ...)
{
	va_list arg;

	va_start(arg, format);
	vfprintf_((&PutUart2Con), format, arg);
	va_end(arg);
}

static void long_itoa (long val, int radix, int len, void (*putc) (char))
{
	char c, sgn = 0, pad = ' ';
	char s[20];
	int  i = 0;


	if (radix < 0) {
		radix = -radix;
		if (val < 0) {
			val = -val;
			sgn = '-';
		}
	}
	if (len < 0) {
		len = -len;
		pad = '0';
	}
	if (len > 20) return;
	do {
		c = (char)((unsigned long)val % radix); //cast!
		//if (c >= 10) c += ('A'-10); //ABCDEF
		if (c >= 10) c += ('a'-10); //abcdef
		else c += '0';            //0123456789
		s[i++] = c;
		val = (unsigned long)val /radix; //cast!
	} while (val);
	if (sgn) s[i++] = sgn;
	while (i < len)
		s[i++] = pad;
	do
		(*putc)(s[--i]);
	while (i);
}

static int vfprintf_(void (*putc)(char), const char* str,  va_list arp)
{
	int d, r, w, s, l;  //d=char, r = radix, w = width, s=zeros, l=long
	char *c;            // for the while loop only
	//const char* p;
#ifdef INCLUDE_FLOAT
	float f;
	long int m, w2;
#endif



	while ((d = *str++) != 0) {
		if (d != '%') {//if it is not format qualifier
			(*putc)(d);
			continue;//get out of while loop
		}
		d = *str++;//if it is '%'get next char
		w = r = s = l = 0;
		if (d == '%') {//if it is % print silmpy %
			(*putc)(d);
			d = *str++;
		}
		if (d == '0') {
			d = *str++; s = 1;  //padd with zeros
		}
		while ((d >= '0')&&(d <= '9')) {
			w += w * 10 + (d - '0');
			d = *str++;
		}
		if (s) w = -w;      //padd with zeros if negative

#ifdef INCLUDE_FLOAT
		w2 = 0;
		if (d == '.')
			d = *str++;
		while ((d >= '0')&&(d <= '9')) {
			w2 += w2 * 10 + (d - '0');
			d = *str++;
		}
#endif

		if (d == 's') {// if string
			c = va_arg(arp, char*); //get buffer addres
			//p = c;//debug
			while (*c)
				(*putc)(*(c++));//write the buffer out
			continue;
		}


		//debug

		//while(*p) PutUartCon(*p++);

		if (d == 'c') {
			(*putc)((char)va_arg(arp, int));
			continue;
		}
		if (d == 'u') {     // %ul
			r = 10;
			d = *str++;
		}
		if (d == 'l') {     // long =32bit
			l = 1;
			if (r==0) r = -10;
			d = *str++;
		}
		//		if (!d) break;
		if (d == 'u') r = 10;//     %lu,    %llu
		else if (d == 'd' || d == 'i') {if (r==0) r = -10;}  //can be 16 or 32bit int
		else if (d == 'X' || d == 'x') r = 16;               // 'x' added by mthomas
		else if (d == 'b') r = 2;
		else str--;                                         // normal character

#ifdef INCLUDE_FLOAT
		if (d == 'f' || d == 'F') {
			f=va_arg(arp, double);
			if (f>0) {
				r=10;
				m=(int)f;
			}
			else {
				r=-10;
				f=-f;
				m=(int)(f);
			}
			long_itoa(m, r, w, (putc));
			f=f-m; m=f*(10^w2); w2=-w2;
			long_itoa(m, r, w2, (putc));
			l=3; //do not continue with long
		}
#endif

		if (!r) continue;  //
		if (l==0) {
			if (r > 0){      //unsigned
				unsigned long temp = (unsigned long)va_arg(arp, unsigned);
				//long_itoa((unsigned long)va_arg(arp, int), r, w, (putc)); //needed for 16bit int, no harm to 32bit int
				long_itoa(temp, r, w, (putc)); //needed for 16bit int, no harm to 32bit int
			}
			else            //signed
			{
				//long_itoa((long)va_arg(arp, int), r, w, (putc));
				long temp = (long)va_arg(arp, int);
				long_itoa(temp, r, w, (putc));
			}
		} else if (l==1){  // long =32bit
			//long_itoa((long)va_arg(arp, long), r, w, (putc));        //no matter if signed or unsigned
			long temp = (long)va_arg(arp, long);
			long_itoa(temp, r, w, (putc));        //no matter if signed or unsigned
		}
	}

	return 0;
}

void PI5008K_RDK_PrintHelp(void)
{
	UART1_PRINTF("==============================================================================================\r\n");	
	UART1_PRINTF("\"xx., Ltd. \"\r\n");	
	UART1_PRINTF("\"reg\"sp\"r\"sp[addr]sp[data]sp[cnt]\\n\r\n");	
	UART1_PRINTF("\"reg\"sp\"w\"sp[addr]sp[data]\\n\r\n");	
	UART1_PRINTF("\"reg\"sp\"cw\"sp[addr]sp[data 1]sp[data 2]sp[data 3]sp[data 4]sp[data ...]sp[data N]\\n\r\n");	
	UART1_PRINTF("\"can\"sp\"tx\"sp[data]sp[loopcnt]\\n\r\n");	
	UART1_PRINTF("==============================================================================================\r\n");	
	//UART2_PRINTF("==============================================================================================\r\n");	
	//UART2_PRINTF("\"Hello PI5008K RDK\"\r\n");	
	//UART2_PRINTF("\"reg\"sp\"r\"sp[addr]sp[data]sp[cnt]\\n\r\n");	
	//UART2_PRINTF("\"reg\"sp\"w\"sp[addr]sp[data]\\n\r\n");	
	//UART2_PRINTF("\"reg\"sp\"cw\"sp[addr]sp[data 1]sp[data 2]sp[data 3]sp[data 4]sp[data ...]sp[data N]\\n\r\n");	
	//UART2_PRINTF("\"can\"sp\"tx\"sp[data]sp[loopcnt]\\n\r\n");	
	//UART2_PRINTF("==============================================================================================\r\n");	

