sentervip/stm32f103-bootloader-Demo/stm32f105rb-IAP/pixelplus_stm32/PI5008K/pi5008k_func.c
}
void PI5008K_UART_BUF_INIT(void)
{
	memset(pi5008k_usart1_get_buffer,0,sizeof(pi5008k_usart1_get_buffer));
	memset(pi5008k_usart2_get_buffer,0,sizeof(pi5008k_usart2_get_buffer));
	memset(pi5008k_usart1_get_cmd,0,sizeof(pi5008k_usart1_get_cmd));
	memset(pi5008k_usart2_get_cmd,0,sizeof(pi5008k_usart2_get_cmd));
	memset(pi5008k_usart1_get_cmd_arg,0,sizeof(pi5008k_usart1_get_cmd_arg));
	memset(pi5008k_usart2_get_cmd_arg,0,sizeof(pi5008k_usart2_get_cmd_arg));
	memset(pi5008k_usart1_get_cmd_arg_div_point,0,sizeof(pi5008k_usart1_get_cmd_arg_div_point));
	memset(pi5008k_usart2_get_cmd_arg_div_point,0,sizeof(pi5008k_usart2_get_cmd_arg_div_point));
	memset(gTempCmdBuffer1,0,sizeof(gTempCmdBuffer1));
	memset(gTempCmdBuffer2,0,sizeof(gTempCmdBuffer2));

}
void PI5008K_Init(void)
{
	PI5008K_RDK_PrintHelp();
	PI5008K_UART_BUF_INIT();
	//PI5008K_Reset_Con();	

}


void PI5008K_Usart1CmdClearBufferAll(void)
{
	memset(pi5008k_usart1_get_buffer,0,PI5008K_USART_BUFFER_SIZE); 
	memset(pi5008k_usart1_get_cmd,0,PI5008K_USART_BUFFER_SIZE);
	memset(pi5008k_usart1_get_cmd_arg,0,10*10);
	memset(pi5008k_usart1_get_cmd_arg_div_point,0,10);	

}
void PI5008K_Usart2CmdClearBufferAll(void)
{
	
	memset(pi5008k_usart2_get_buffer,0,PI5008K_USART_BUFFER_SIZE); 
	memset(pi5008k_usart2_get_cmd,0,PI5008K_USART_BUFFER_SIZE);
	memset(pi5008k_usart2_get_cmd_arg,0,10*10);
	memset(pi5008k_usart2_get_cmd_arg_div_point,0,10);	

}


void PI5008K_Usart1CmdExistFlagClear(void)
{
	pi5008k_usart1_cmd_exist_flag=0;
	UART1_PRINTF(">> ");
	PI5008K_Usart1CmdClearBufferAll();
}
unsigned int PI5008K_Usart1CmdExistFlagGet(void)
{
	return pi5008k_usart1_cmd_exist_flag;
}
void PI5008K_Usart2CmdExistFlagClear(void)
{
	pi5008k_usart2_cmd_exist_flag=0;
	UART2_PRINTF(">> ");
	PI5008K_Usart2CmdClearBufferAll();
}
unsigned int PI5008K_Usart2CmdExistFlagGet(void)
{
	return pi5008k_usart2_cmd_exist_flag;
}
int PI5008K_UsartCmdArgHexGet(char *str)
{
	char arg_temp[10];
	int arg_temp_size;
	int arg;
	
	//printf("\r\n in the PR1000K_UsartCmdArgHexGet %s \r\n ",str); 		
	
	arg=(int)strtol(str, 0, 16);

	return arg;
	
}


int PI5008K_Usart1GetCh(void)
{
	uint8_t ch;
	while(USART_GetFlagStatus(USART1,USART_FLAG_RXNE)==RESET);
	ch=USART_ReceiveData(USART1);
	return ch;
}
int PI5008K_Usart1Push(void)
{
	char *usart_bf;
	int cmd_arg_buffer_size;
	usart_bf = &pi5008k_usart1_get_buffer[0]; 
	int i=0;


	
	usart_bf[pi5008k_usart1_buffer_cnt] = PI5008K_Usart1GetCh(); //recieve
	
	//printf("\r\ndebug0:%s",usart_bf);
	USART_SendData(USART1, usart_bf[pi5008k_usart1_buffer_cnt]); //feedback function

	//check "Enter Button"
	if(usart_bf[pi5008k_usart1_buffer_cnt]=='\r')
	{
		/*last argu check & init cnt*/
		if(pi5008k_usart1_arg_div_point_cnt!=0)
		{
			pi5008k_usart1_get_cmd_arg_div_point[pi5008k_usart1_arg_div_point_cnt]=pi5008k_usart1_buffer_cnt;

			//cmd_arg_buffer_size = pi5008k_usart1_buffer_cnt-pi5008k_usart1_get_cmd_arg_div_point[pi5008k_usart1_arg_div_point_cnt-1]+1;
			cmd_arg_buffer_size = pi5008k_usart1_buffer_cnt-pi5008k_usart1_get_cmd_arg_div_point[pi5008k_usart1_arg_div_point_cnt-1];
			// "+1" meaning is NULL character.
			
			memcpy(pi5008k_usart1_get_cmd_arg[pi5008k_usart1_arg_div_point_cnt-1], \
			usart_bf+pi5008k_usart1_get_cmd_arg_div_point[pi5008k_usart1_arg_div_point_cnt-1]+1, \
			cmd_arg_buffer_size-1); //add NULL			
			//strcat(pi5008k_usart1_get_cmd_arg[pi5008k_usart1_arg_div_point_cnt-1],"\n");
		}
		else
		{
			memcpy(pi5008k_usart1_get_cmd,usart_bf,pi5008k_usart1_buffer_cnt);
			//printf("\r\n test = %s \r\n",pi5008k_usart1_get_cmd);
		}
		pi5008k_usart1_get_cmd_arg_div_point[pi5008k_usart1_arg_div_point_cnt]=pi5008k_usart1_buffer_cnt;

		//memcpy(pi5008k_usart_get_cmd,usart_bf,pi5008k_usart_buffer_cnt);
		//printf("\r\narg0 = %s \r\n",pi5008k_usart1_get_cmd);
		//printf("arg1 = 0x%02x \r\n",*(usart_bf+pi5008k_usart1_get_cmd_arg_div_point[pi5008k_usart1_arg_div_point_cnt-1]+1));
		//printf("arg2 = 0x%02x \r\n",*(usart_bf+pi5008k_usart1_get_cmd_arg_div_point[pi5008k_usart1_arg_div_point_cnt-1]+2));
		//printf("arg3 = 0x%02x \r\n",*(usart_bf+pi5008k_usart1_get_cmd_arg_div_point[pi5008k_usart1_arg_div_point_cnt-1]+3));
		//printf("arg4 = 0x%02x \r\n",*(usart_bf+pi5008k_usart1_get_cmd_arg_div_point[pi5008k_usart1_arg_div_point_cnt-1]+4));
		pi5008k_usart_arg_cnt_for_test=pi5008k_usart1_arg_div_point_cnt;
		pi5008k_usart1_arg_div_point_cnt=0;
		pi5008k_usart1_buffer_cnt=0;			
		
		USART_SendData(USART1, '\r');
		return 0;
	}
	//check "Back Space Button" /*TODO*/
	else if(usart_bf[pi5008k_usart1_buffer_cnt]==127 || usart_bf[pi5008k_usart1_buffer_cnt]==8)
	{
		if(pi5008k_usart1_buffer_cnt>0)
		{

				gTempCmdBuffer1[pi5008k_usart1_buffer_cnt-1]='\0';
				UART1_PRINTF("%c[1A", 0x1B); // 1line up
				UART1_PRINTF("\n\r%c[2K%s %s", 0x1B, CMD_PROMPT, gTempCmdBuffer1); 
				pi5008k_usart1_buffer_cnt = strlen(gTempCmdBuffer1);
				
				//printf("\r\ndebug1:%s\r\n",gTempCmdBuffer);
				//printf("\r\ndebug2:%d,%d\r\n",pi5008k_usart_buffer_cnt,strlen(gTempCmdBuffer));
				
		}
	}
	else 
	{
		//check "Space Button" and get token
		if(usart_bf[pi5008k_usart1_buffer_cnt]== 0x20)
		{
			/* argu div check & increase cnt*/
			pi5008k_usart1_get_cmd_arg_div_point[pi5008k_usart1_arg_div_point_cnt]=pi5008k_usart1_buffer_cnt;
			if(pi5008k_usart1_arg_div_point_cnt==0)
			{
				memcpy(pi5008k_usart1_get_cmd,usart_bf,pi5008k_usart1_buffer_cnt);
				//printf("\r\n test = %s \r\n",pr1000_usart_get_cmd);
			}
			else
			{

					
					memcpy(pi5008k_usart1_get_cmd_arg[pi5008k_usart1_arg_div_point_cnt-1], \
					usart_bf+pi5008k_usart1_get_cmd_arg_div_point[pi5008k_usart1_arg_div_point_cnt-1]+1, \
					pi5008k_usart1_get_cmd_arg_div_point[pi5008k_usart1_arg_div_point_cnt]- \
					//pi5008k_usart1_get_cmd_arg_div_point[pi5008k_usart1_arg_div_point_cnt-1]+1); //add NULL
					pi5008k_usart1_get_cmd_arg_div_point[pi5008k_usart1_arg_div_point_cnt-1]-1); 
				
					//printf("\r\n space argargarg \r\n");
					//printf("\r\n test+pr1000_usart_get_cmd_arg_div_point[pr1000_usart_arg_div_point_cnt-1] = %s \r\n",test+pr1000_usart_get_cmd_arg_div_point[pr1000_usart_arg_div_point_cnt-1]);
					//printf("\r\n test = %s \r\n",test);
					//printf("\r\n pr1000_usart_arg_div_point_cnt = %d \r\n",pr1000_usart_arg_div_point_cnt);
					//printf("\r\n pr1000_usart_get_cmd_arg_div_point[pr1000_usart_arg_div_point_cnt-1] = %d \r\n",pr1000_usart_get_cmd_arg_div_point[pr1000_usart_arg_div_point_cnt-1]);
					//printf("\r\n pr1000_usart_get_cmd_arg_div_point[pr1000_usart_arg_div_point_cnt] = %d \r\n",pr1000_usart_get_cmd_arg_div_point[pr1000_usart_arg_div_point_cnt]);
					//printf("\r\n space argargarg \r\n");

					
