sentervip/stm32f103-bootloader-Demo/stm32f105rb-IAP/pixelplus_stm32/PI5008K/pi5008k_func.c
			}
			pi5008k_usart1_arg_div_point_cnt++;
		}
		pi5008k_usart1_buffer_cnt++;
		strcpy(gTempCmdBuffer1, usart_bf);
		
	}

	return 1;
}
int PI5008K_Usart2GetCh(void)
{
	uint8_t ch;
	while(USART_GetFlagStatus(USART2,USART_FLAG_RXNE)==RESET);
	ch=USART_ReceiveData(USART2);
	return ch;
}
int PI5008K_Usart2_Get_Response(void)
{
	char *usart_bf;
	int cmd_arg_buffer_size;
	usart_bf = &pi5008k_usart2_get_buffer[0]; 

	
	usart_bf[pi5008k_usart2_buffer_cnt] = PI5008K_Usart2GetCh(); //recieve
	
	//printf("\r\ndebug0:%s",usart_bf);
	//USART_SendData(USART1, usart_bf[pi5008k_usart2_buffer_cnt]); //feedback function
	//UART1_PRINTF("%s",usart_bf[pi5008k_usart2_buffer_cnt]); 

	//check "Enter Button" //LF code
	if(usart_bf[pi5008k_usart2_buffer_cnt]==0x0A)
	{
		memcpy(pi5008k_usart2_get_cmd,usart_bf,pi5008k_usart2_buffer_cnt);
		return 0;		
	}
	else 
	{		
		pi5008k_usart2_buffer_cnt++;
	}

	return 1;
}

int PI5008K_Usart2Push(void)
{
	char *usart_bf;
	int cmd_arg_buffer_size;
	usart_bf = &pi5008k_usart2_get_buffer[0]; 



	
	usart_bf[pi5008k_usart2_buffer_cnt] = PI5008K_Usart2GetCh(); //recieve
	
	//printf("\r\ndebug0:%s",usart_bf);
	USART_SendData(USART2, usart_bf[pi5008k_usart2_buffer_cnt]); //feedback function

	//check "Enter Button"
	if(usart_bf[pi5008k_usart2_buffer_cnt]=='\r')
	{
		/*last argu check & init cnt*/
		if(pi5008k_usart2_arg_div_point_cnt!=0)
		{
			pi5008k_usart2_get_cmd_arg_div_point[pi5008k_usart2_arg_div_point_cnt]=pi5008k_usart2_buffer_cnt;

			cmd_arg_buffer_size = pi5008k_usart2_buffer_cnt-pi5008k_usart2_get_cmd_arg_div_point[pi5008k_usart2_arg_div_point_cnt-1]+1;
			// "+1" meaning is NULL character.
			
			memcpy(pi5008k_usart2_get_cmd_arg[pi5008k_usart2_arg_div_point_cnt-1], \
			usart_bf+pi5008k_usart2_get_cmd_arg_div_point[pi5008k_usart2_arg_div_point_cnt-1], \
			cmd_arg_buffer_size); //add NULL						
		}
		else
		{
			memcpy(pi5008k_usart2_get_cmd_arg,usart_bf,pi5008k_usart2_buffer_cnt);
			//printf("\r\n test = %s \r\n",pr1000_usart_get_cmd);
		}
		pi5008k_usart2_get_cmd_arg_div_point[pi5008k_usart2_arg_div_point_cnt]=pi5008k_usart2_buffer_cnt;

		//memcpy(pi5008k_usart2_get_cmd,usart_bf,pi5008k_usart2_buffer_cnt);
		//printf("\r\n test = %s \r\n",pi5008k_usart2_get_cmd);

		pi5008k_usart2_arg_div_point_cnt=0;
		pi5008k_usart2_buffer_cnt=0;			
		
		USART_SendData(USART2, '\r');
		return 0;
	}
	//check "Back Space Button" /*TODO*/
	else if(usart_bf[pi5008k_usart2_buffer_cnt]==127 || usart_bf[pi5008k_usart2_buffer_cnt]==8)
	{
		if(pi5008k_usart2_buffer_cnt>0)
		{

				gTempCmdBuffer2[pi5008k_usart2_buffer_cnt-1]='\0';
				UART2_PRINTF("%c[1A", 0x1B); // 1line up
				UART2_PRINTF("\n\r%c[2K%s %s", 0x1B, CMD_PROMPT, gTempCmdBuffer2); 
				pi5008k_usart2_buffer_cnt = strlen(gTempCmdBuffer2);
				
				//printf("\r\ndebug1:%s\r\n",gTempCmdBuffer);
				//printf("\r\ndebug2:%d,%d\r\n",pi5008k_usart_buffer_cnt,strlen(gTempCmdBuffer));
				
		}
	}
	else 
	{
		//check "Space Button" and get token
		if(usart_bf[pi5008k_usart2_buffer_cnt]== 0x20)
		{
			/* argu div check & increase cnt*/
			pi5008k_usart2_get_cmd_arg_div_point[pi5008k_usart2_arg_div_point_cnt]=pi5008k_usart2_buffer_cnt;
			if(pi5008k_usart2_arg_div_point_cnt==0)
			{
				memcpy(pi5008k_usart2_get_cmd,usart_bf,pi5008k_usart2_buffer_cnt);
				//printf("\r\n test = %s \r\n",pr1000_usart_get_cmd);
			}
			else
			{

					
					memcpy(pi5008k_usart2_get_cmd_arg[pi5008k_usart2_arg_div_point_cnt-1], \
					usart_bf+pi5008k_usart2_get_cmd_arg_div_point[pi5008k_usart2_arg_div_point_cnt-1], \
					pi5008k_usart2_get_cmd_arg_div_point[pi5008k_usart2_arg_div_point_cnt]- \
					pi5008k_usart2_get_cmd_arg_div_point[pi5008k_usart2_arg_div_point_cnt-1]+1); //add NULL
					
				
					//printf("\r\n space argargarg \r\n");
					//printf("\r\n test+pr1000_usart_get_cmd_arg_div_point[pr1000_usart_arg_div_point_cnt-1] = %s \r\n",test+pr1000_usart_get_cmd_arg_div_point[pr1000_usart_arg_div_point_cnt-1]);
					//printf("\r\n test = %s \r\n",test);
					//printf("\r\n pr1000_usart_arg_div_point_cnt = %d \r\n",pr1000_usart_arg_div_point_cnt);
					//printf("\r\n pr1000_usart_get_cmd_arg_div_point[pr1000_usart_arg_div_point_cnt-1] = %d \r\n",pr1000_usart_get_cmd_arg_div_point[pr1000_usart_arg_div_point_cnt-1]);
					//printf("\r\n pr1000_usart_get_cmd_arg_div_point[pr1000_usart_arg_div_point_cnt] = %d \r\n",pr1000_usart_get_cmd_arg_div_point[pr1000_usart_arg_div_point_cnt]);
					//printf("\r\n space argargarg \r\n");

					
			}
			pi5008k_usart2_arg_div_point_cnt++;
		}
		pi5008k_usart2_buffer_cnt++;
		strcpy(gTempCmdBuffer2, usart_bf);
		
	}

	return 1;
}




void swap(char*  a, char*  b)
{
    char temp;
 
    temp=*a;
    *a=*b;
    *b=temp;
    
}

void reverse(char *str, int i)
{
	int start =0;
	int end=i-1;
	while(start <end)
	{
		swap((str+start), (str+end));
		start++;
		end--;
	}
}

// Implementation of itoa()
char* itoa(unsigned int num, char* str, int base)
{
    int i = 0;
    bool isNegative = FALSE;
    int inum = 0;
 
    /* Handle 0 explicitely, otherwise empty string is printed for 0 */
    if (num == 0)
    {
        str[i++] = '0';
        str[i] = '\0';
        return str;
    }
 
    // In standard itoa(), negative numbers are handled only with 
    // base 10. Otherwise numbers are considered unsigned.
    if ((int)num < 0 && base == 10)
    {
        isNegative = TRUE;
        inum = -num;

        // Process individual digits
        while (inum != 0)
        {
            int rem = inum % base;
            str[i++] = (rem > 9)? (rem-10) + 'a' : rem + '0';
            inum = inum/base;
        }

        // If number is negative, append '-'
        if (isNegative)
            str[i++] = '-';

        str[i] = '\0'; // Append string terminator

        // Reverse the string
        reverse(str, i);
    }
    else
    {
        // Process individual digits
        while (num != 0)
        {
            int rem = num % base;
            str[i++] = (rem > 9)? (rem-10) + 'a' : rem + '0';
            num = num/base;
        }

        // If number is negative, append '-'
        if (isNegative)
            str[i++] = '-';

