sentervip/stm32f103-bootloader-Demo/stm32f105rb-IAP/pixelplus_stm32/PI5008K/pi5008k_func.c
        str[i] = '\0'; // Append string terminator

        // Reverse the string
        reverse(str, i);
    }
 
    return str;
}




char str_cs_buf[100]="";
char * PI5008K_UartcmdGetCheckSum(unsigned char *buf,unsigned int buf_size)
{
	unsigned int check_sum=0;
	char str_0x[3]="0x";
	char ascii_us_code[1]=" ";
	unsigned int i=0;

	check_sum=ascii_us_code[0];//add sp code in checksum
	str_cs_buf[0]=ascii_us_code[0];
	strcpy(&str_cs_buf[1],str_0x);
	
	//UART1_PRINTF("buf_size = 0x%4x \r\n",buf_size); 
	for(i=0;i<buf_size;i++)
	{
		check_sum+=buf[i];
		//UART1_PRINTF("buf[%d] = 0x%8x \r\n",i,buf[i]); 
		
	}
	check_sum = check_sum&0xFFFFFFFF;
	
	itoa(check_sum,&str_cs_buf[3],16);
	#if 0
	UART1_PRINTF("cs hex = 0x%8x \r\n",check_sum); 
	UART1_PRINTF("cs str = %s \r\n",str_cs_buf); 
	for(i=0;i<strlen(str_cs_buf);i++)
	{
		UART1_PRINTF("0x%2x ",str_cs_buf[i]); 
		
	}
	UART1_PRINTF(" \r\n"); 
	#endif
	
	return str_cs_buf;
	
}

void PI5008K_Uart1_CmdParsing(void)
{
	char send_cmd_buf[100];
	char temp;
	int i=0;
	int loopcnt=0;
	
	if(!strcmp(pi5008k_usart1_get_cmd,"t"))
	{
		if(!strcmp(pi5008k_usart1_get_cmd_arg[0],"con"))
		{
			if(!strcmp(pi5008k_usart1_get_cmd_arg[1],"rem"))
			{
		
				//UART1_PRINTF("hello remote world \r\n"); 
				if(!strcmp(pi5008k_usart1_get_cmd_arg[2],"up"))
				{
					strcpy(send_cmd_buf,"t con rem up");					
				}
				else if(!strcmp(pi5008k_usart1_get_cmd_arg[2],"down"))
				{
					strcpy(send_cmd_buf,"t con rem down");		
				}
				else if(!strcmp(pi5008k_usart1_get_cmd_arg[2],"left")) 
				{
					strcpy(send_cmd_buf,"t con rem left");		
				}
				else if(!strcmp(pi5008k_usart1_get_cmd_arg[2],"right")) 
				{
					strcpy(send_cmd_buf,"t con rem right");		
				}
				else if(!strcmp(pi5008k_usart1_get_cmd_arg[2],"center")) 
				{
					strcpy(send_cmd_buf,"t con rem center");		
				}
				
				strcat(send_cmd_buf,PI5008K_UartcmdGetCheckSum((unsigned char *)send_cmd_buf,strlen(send_cmd_buf)));
				strcat(send_cmd_buf,"\n");
				
				//UART1_PRINTF(" debug \r\n"); 
				//UART1_PRINTF("send uart data = \"%s\"",send_cmd_buf); 
				for(i=0;i<strlen(send_cmd_buf);i++)
				{
					//UART1_PRINTF("0x%02x ",send_cmd_buf[i]); 
					
				}	
				//UART1_PRINTF(" \r\n"); 
				//UART1_PRINTF(" debug end \r\n"); 
				
				UART2_PRINTF("%s",send_cmd_buf); //send data
			}

		}
		else if(!strcmp(pi5008k_usart1_get_cmd_arg[0],"reg")) //add space
		{

			if(!strcmp(pi5008k_usart1_get_cmd_arg[1],"sw")) //add space
			{
				UART1_PRINTF("hello reg world \r\n"); 

				strcpy(send_cmd_buf,"t reg sw ");					
				temp=strlen(send_cmd_buf)+strlen(pi5008k_usart1_get_cmd_arg[2])+\
					strlen(pi5008k_usart1_get_cmd_arg[3])+1;//add sp

				strcat(send_cmd_buf,pi5008k_usart1_get_cmd_arg[2]);
				strcat(send_cmd_buf," ");					
				strcat(send_cmd_buf,pi5008k_usart1_get_cmd_arg[3]);
				strcat(send_cmd_buf,PI5008K_UartcmdGetCheckSum((unsigned char *)send_cmd_buf,temp));
				strcat(send_cmd_buf,"\n");
				
				UART1_PRINTF(" debug \r\n"); 
				UART1_PRINTF("send uart data = %s\r\n",send_cmd_buf); 
				for(i=0;i<strlen(send_cmd_buf);i++)
				{
					UART1_PRINTF("0x%02x ",send_cmd_buf[i]); 
					
				}	
				UART1_PRINTF(" \r\n"); 
				UART1_PRINTF(" debug end \r\n"); 
				
				UART2_PRINTF("%s",send_cmd_buf); //send data
			}
		}

		
		
	}
	else if(!strcmp(pi5008k_usart1_get_cmd,"can"))
	{

		if(!strcmp(pi5008k_usart1_get_cmd_arg[0],"tx"))
		{
			loopcnt = PI5008K_UsartCmdArgHexGet(pi5008k_usart1_get_cmd_arg[2]);
			UART1_PRINTF("loopcnt = %d \r\n",loopcnt); 

//			KeyNumber = PI5008K_UsartCmdArgHexGet(pi5008k_usart1_get_cmd_arg[1]);
			//UART1_PRINTF("test can tx [0x%2x] \r\n",KeyNumber); 
			UART1_PRINTF("test can tx \r\n");
			//TxMessage.Data[0] = KeyNumber;

			
			//GPIO_WriteBit(GPIOA, GPIO_Pin_12, Bit_RESET); 
			//Delay_ms(200);	// delay 200ms
			//GPIO_WriteBit(GPIOA, GPIO_Pin_12, Bit_SET); 
			//GPIO_PinRemapConfig(GPIO_Remap1_CAN1 , ENABLE);
			for(i=0;i<loopcnt;i++)
			{
				UART1_PRINTF("loopcnt = [%d/%d] \r\n",i,loopcnt); 
				//CAN_Transmit(CAN1, &TxMessage);
				
				Delay_ms(200);	// delay 200ms
			}
		
		}

	}
	else
	{
		UART1_PRINTF("unvaild cmd \r\n"); 
	}
	
	UART1_PRINTF("end remote world \r\n"); 

}
void PI5008K_Uart_Reg_Single_Write(unsigned int  addr,unsigned int data)
{
	char send_cmd_buf[100]={0, };
	char temp;
	int i=0;
	char str_add[100]={0, };
	char str_data[100]={0, };
	char str_0x[2]="0x";
	
	strcpy(&str_add[0],str_0x);
	strcpy(&str_data[0],str_0x);

	

	
	itoa(addr,&str_add[2],16);
	itoa(data,&str_data[2],16);

	
	strcpy(send_cmd_buf,"t reg sw ");					
	temp=strlen(send_cmd_buf)+strlen(str_add)+\
		strlen(str_data)+1;//add sp
	
	strcat(send_cmd_buf,str_add);
	strcat(send_cmd_buf," ");					
	strcat(send_cmd_buf,str_data);
	strcat(send_cmd_buf,PI5008K_UartcmdGetCheckSum((unsigned char *)send_cmd_buf,temp));
	strcat(send_cmd_buf,"\n");
	
	UART1_PRINTF(" debug \r\n"); 
	UART1_PRINTF(" str_add = [0x%x] \r\n",addr); 
	UART1_PRINTF(" str_data = [0x%x] \r\n",data); 
	UART1_PRINTF(" str_add = [%s] \r\n",str_add); 
	UART1_PRINTF(" str_data = [%s] \r\n",str_data); 
	UART1_PRINTF("send uart data = %s\r\n",send_cmd_buf); 
	for(i=0;i<strlen(send_cmd_buf);i++)
	{
		UART1_PRINTF("0x%02x ",send_cmd_buf[i]); 
		
	}	
	UART1_PRINTF(" \r\n"); 
	UART1_PRINTF(" debug end \r\n"); 
	UART2_PRINTF("%s",send_cmd_buf); //send data to pi5008k

}
void PI5008K_Uart_Con_Remote_Cmd(unsigned int dir)
{
	char send_cmd_buf[100];
	int i=0;
	
	//UART1_PRINTF(" dir  = %d \r\n",dir); 
	switch (dir)
	{
		case REM_DIR_UP:
		{
			strcpy(send_cmd_buf,"t con rem up");					
		}
			break;
		case REM_DIR_UP_LONG:
		{
			strcpy(send_cmd_buf,"t con rem uplong");					
		}
			break;
		
		case REM_DIR_DOWN:
		{
			strcpy(send_cmd_buf,"t con rem down");		
		}
			break;
		case REM_DIR_DOWN_LONG:
		{
			strcpy(send_cmd_buf,"t con rem downlong");		
		}
			break;
		case REM_DIR_LEFT:
		{
			strcpy(send_cmd_buf,"t con rem left");		
		}
			break;
		case REM_DIR_LEFT_LONG:
		{
			strcpy(send_cmd_buf,"t con rem leftlong");		
		}
			break;
		case REM_DIR_RIGHT:
		{
			strcpy(send_cmd_buf,"t con rem right"); 	
		}
			break;
		case REM_DIR_RIGHT_LONG:
		{
			strcpy(send_cmd_buf,"t con rem rightlong"); 	
		}
			break;
		case REM_DIR_CENTER:
		{
			strcpy(send_cmd_buf,"t con rem center");		
		}
			break;
		case REM_DIR_CENTER_LONG:
		{
			strcpy(send_cmd_buf,"t con rem centerlong");					
		}
			break;
		case REM_MENU:
		{			
			strcpy(send_cmd_buf,"t con rem menu");					
		}
			break;
		case REM_MENU_LONG:
		{			
			strcpy(send_cmd_buf,"t con rem menulong");					
		}
			break;
		case REM_NAVI:
		{			
			strcpy(send_cmd_buf,"t con rem navi");					
		}
			break;
		case REM_NAVI_LONG:
		{			
			strcpy(send_cmd_buf,"t con rem navilong");					
		}
			break;
		default:
		{
			UART1_PRINTF("unvaild cmd \r\n"); 
		}
			break;
	}
	strcat(send_cmd_buf,PI5008K_UartcmdGetCheckSum((unsigned char *)send_cmd_buf,strlen(send_cmd_buf)));
	strcat(send_cmd_buf,"\n");
	
