sentervip/stm32f103-bootloader-Demo/stm32f105rb-IAP/pixelplus_stm32/PI5008K/pi5008k_func.c
	//UART1_PRINTF(" debug \r\n"); 
	//UART1_PRINTF("send uart data = %s",send_cmd_buf); 
	for(i=0;i<strlen(send_cmd_buf);i++)
	{
		//UART1_PRINTF("0x%02x ",send_cmd_buf[i]); 
		
	}	
	//UART1_PRINTF(" \r\n"); 
	//UART1_PRINTF(" debug end \r\n"); 
	UART1_PRINTF("send uart data = %s",send_cmd_buf); //send data to pi5008k
	UART2_PRINTF("%s",send_cmd_buf); //send data to pi5008k
	//UART2_PRINTF("test"); //send data to pi5008k
	//UART2_PRINTF("\n"); //send data to pi5008k	
}
/**
t con rem default
t con rem rightRear
t con rem rightBack
t con rem driving
t con rem leftBack
t con rem rightRear
*/
void PI5008K_Uart_Con_Remote_Cmd_View(uint8_t view)
{
	char send_cmd_buf[50];

	if(view >= VIEW_INVALID ){
	    return;
	}
	
	switch (view)
	{
		
		case VIEW_2:
		{
			strcpy(send_cmd_buf,"t con rem rightRear");					
		}
			break;
		
		case VIEW_4:
		{
			strcpy(send_cmd_buf,"t con rem rightBack");		
		}
			break;
		case VIEW_5:
		{
			strcpy(send_cmd_buf,"t con rem driving");		
		}
			break;
		case VIEW_6:
		{
			strcpy(send_cmd_buf,"t con rem leftBack");		
		}
			break;
		case VIEW_8:
		{
			strcpy(send_cmd_buf,"t con rem leftRear");		
		}
			break;
		case VIEW_DEFAULT: default:
		{
			strcpy(send_cmd_buf,"t con rem default");					
		}		
			break;
	}
	strcat(send_cmd_buf,PI5008K_UartcmdGetCheckSum((unsigned char *)send_cmd_buf,strlen(send_cmd_buf)));
	strcat(send_cmd_buf,"\n");
	UART1_PRINTF("send uart data: %s",send_cmd_buf); 
	UART2_PRINTF("%s",send_cmd_buf); //send data to pi5008k
}
void PI5008K_UartCmdProcessing(void)
{
	char i2cData=0;
	int i=0;
	
	if(PI5008K_Usart1CmdExistFlagGet()) //with external(pc)
	{
		UART1_PRINTF("\r\n>> cmd :%s \r\n",pi5008k_usart1_get_cmd);	

		for(i=0;i<pi5008k_usart_arg_cnt_for_test;i++)
		{
			UART1_PRINTF(">> arg %d : %s \r\n",i,pi5008k_usart1_get_cmd_arg[i]); 		
		}
		pi5008k_usart_arg_cnt_for_test=0;
		//UART1_PRINTF(">> %s \r\n ",pi5008k_usart1_get_cmd);	
		//UART1_PRINTF("[[remote controller command set]] command in %s \r\n ",pi5008k_usart1_get_cmd);			
		//UART1_PRINTF("[[remote controller command set]] arg1:[%s] \r\n ",pi5008k_usart1_get_cmd_arg[0]);	
		//UART1_PRINTF("[[remote controller command set]] arg2 :[%s] \r\n ",pi5008k_usart1_get_cmd_arg[1]);	
		//UART1_PRINTF("[[remote controller command set]] arg3 :[%s] \r\n ",pi5008k_usart1_get_cmd_arg[2]);
		//UART1_PRINTF("[[remote controller command set]] arg4: [%s] \r\n ",pi5008k_usart1_get_cmd_arg[3]);	
		//UART1_PRINTF("[[remote controller command set]] arg5 : [%s] \r\n ",pi5008k_usart1_get_cmd_arg[4]);	
		//UART1_PRINTF("[[remote controller command set]] arg6 : [%s] \r\n ",pi5008k_usart1_get_cmd_arg[5]);
		PI5008K_Uart1_CmdParsing();




			//UART1_PRINTF("unvaild cmd \r\n");	
			PI5008K_RDK_PrintHelp();
			PI5008K_Usart1CmdExistFlagClear();		
	}
	else if(PI5008K_Usart2CmdExistFlagGet()) //with pi5008k
	{
		UART2_PRINTF(">> %s \r\n ",pi5008k_usart2_get_cmd);	
		UART1_PRINTF(">>[UART2] %s \r\n ",pi5008k_usart2_get_cmd);	
		#if 0
		if(strcmp(pi5008k_usart_get_cmd,"i2cw")==0)
		{
			printf("[[i2cWrite]] command in %s \r\n ",pi5008k_usart_get_cmd);			
			printf("[[i2cWrite]] page : 0x%x \r\n ",PI5008K_UsartCmdArgHexGet(pi5008k_usart_get_cmd_arg[0]));	
			printf("[[i2cWrite]] addr : 0x%x \r\n ",PI5008K_UsartCmdArgHexGet(pi5008k_usart_get_cmd_arg[1]));	
			printf("[[i2cWrite]] data : 0x%x \r\n ",PI5008K_UsartCmdArgHexGet(pi5008k_usart_get_cmd_arg[2]));
			
			PI5008K_PageWrite(0, (0x5C<<1), PI5008K_UsartCmdArgHexGet(pi5008k_usart_get_cmd_arg[0]), (unsigned char)PI5008K_UsartCmdArgHexGet(pi5008k_usart_get_cmd_arg[1]),\
							(unsigned char)PI5008K_UsartCmdArgHexGet(pi5008k_usart_get_cmd_arg[2]));
			
		}
		else if(strcmp(pi5008k_usart_get_cmd,"i2cr")==0)
		{
			printf("[[i2cRead]] command in : %s \r\n ",pi5008k_usart_get_cmd);	
			printf("[[i2cRead]] page : 0x%x \r\n ",PI5008K_UsartCmdArgHexGet(pi5008k_usart_get_cmd_arg[0]));	
			printf("[[i2cRead]] addr : 0x%x \r\n ",PI5008K_UsartCmdArgHexGet(pi5008k_usart_get_cmd_arg[1]));	
			printf("[[i2cRead]] cnt : %d \r\n ",PI5008K_UsartCmdArgHexGet(pi5008k_usart_get_cmd_arg[2]));	


			for(i=0;i<PI5008K_UsartCmdArgHexGet(pi5008k_usart_get_cmd_arg[2]);i++)
			{
				PI5008K_PageRead(0, (0x5C<<1), PI5008K_UsartCmdArgHexGet(pi5008k_usart_get_cmd_arg[0]), \
				(unsigned char)PI5008K_UsartCmdArgHexGet(pi5008k_usart_get_cmd_arg[1])+i,&i2cData);
				printf("[[i2cRead]] {0x%02x , 0x%02x}, \r\n ",(unsigned char)PI5008K_UsartCmdArgHexGet(pi5008k_usart_get_cmd_arg[1])+i,i2cData);	
			}
		}
		else if(strcmp(pi5008k_usart_get_cmd,"loopstop")==0)
		{
			printf("[[loopstop]] \r\n");	
			loopstopflag=1;
		}
		else if(strcmp(pi5008k_usart_get_cmd,"loopstart")==0)
		{
			printf("[[loopstart]] \r\n");	
			loopstopflag=0;
		}
		else
		{
			printf("unvaild cmd \r\n");	
			PI5008K_RDK_PrintHelp();
		}
		#endif

			UART2_PRINTF("unvaild cmd \r\n");	
			UART1_PRINTF(">>[UART2] unvaild cmd \r\n");	
			PI5008K_RDK_PrintHelp();
			PI5008K_Usart2CmdExistFlagClear();		
	}
}



void USART1_IRQHandler(void)
{	
	if(USART_GetITStatus(USART1, USART_IT_RXNE) != RESET)
	{
		if(PI5008K_Usart1Push()==0)// 0 : get "Enter"
		{
			//memcpy(pr1000_usart_get_cmd,pr1000_usart_get_buffer,PR1000_USART_BUFFER_SIZE);
			//printf("\r\n cmd : %s \r\n ",pr1000_usart_get_cmd);			
			//printf("\r\n arg1_div : %d \r\n ",pr1000_usart_get_cmd_arg_div_point[0]);
			//printf("\r\n arg2_div : %d \r\n ",pr1000_usart_get_cmd_arg_div_point[1]);
			//printf("\r\n arg3_div : %d \r\n ",pr1000_usart_get_cmd_arg_div_point[2]);

			//printf("\r\n arg0 : 0x%2x \r\n ",PR1000K_UsartCmdArgHexGet(pr1000_usart_get_cmd_arg[0]));
			//printf("\r\n arg1 : 0x%2x \r\n ",PR1000K_UsartCmdArgHexGet(pr1000_usart_get_cmd_arg[1]));
			//printf("\r\n arg2 : 0x%2x \r\n ",PR1000K_UsartCmdArgHexGet(pr1000_usart_get_cmd_arg[2]));
			
			memset(pi5008k_usart1_get_cmd_arg_div_point,0x00,10);
			memset(pi5008k_usart1_get_buffer,0x00,PI5008K_USART_BUFFER_SIZE);
			pi5008k_usart1_cmd_exist_flag=1;
		}
		USART_ClearITPendingBit(USART1, USART_IT_RXNE);
	}	
}

void USART2_IRQHandler(void)
{	
	//UART2_PRINTF("\r\n USART2_IRQHandler \r\n "); 		
	if(USART_GetITStatus(USART2, USART_IT_RXNE) != RESET)
	{
		//normal sequence like usart1
		#if 0
			if(PI5008K_Usart2Push()==0)// 0 : get "Enter"
			{
				memset(pi5008k_usart2_get_cmd_arg_div_point,0x00,10);
				memset(pi5008k_usart2_get_buffer,0x00,PI5008K_USART_BUFFER_SIZE);
				pi5008k_usart2_cmd_exist_flag=1;
				UART1_PRINTF("\r\n uart2 cmd : %s \r\n ",pi5008k_usart2_get_cmd);	
			}		
		#else
			//pi5008k's response
			if(PI5008K_Usart2_Get_Response()==0)//get '\n' LF code
			{
				UART1_PRINTF("uart2 cmd : %s \r\n ",pi5008k_usart2_get_cmd);	
				memset(pi5008k_usart2_get_cmd,0x00,PI5008K_USART_BUFFER_SIZE);			
				memset(pi5008k_usart2_get_buffer,0x00,PI5008K_USART_BUFFER_SIZE);			
				pi5008k_usart2_buffer_cnt =0;
				
