sentervip/stm32f103-bootloader-Demo/stm32f105rb-IAP/pixelplus_stm32/PI5008K/pi5008k_func.c
			}
			//UART1_PRINTF("test %s",pi5008k_usart2_get_cmd); 
		#endif
		USART_ClearITPendingBit(USART2, USART_IT_RXNE);
	}	
}
uint16_t g_TimerVal_previous = 0;
uint16_t cnt_10us=0;
uint16_t cnt_100us=0;
uint16_t cnt_1ms=0;
uint16_t cnt_1s=0;

void EXTI0_IRQHandler(void)
{

    uint16_t timVal, diffVal;
    
    if(EXTI_GetITStatus(EXTI_Line0) != RESET) {
	timVal = cnt_10us;

        if(timVal > g_TimerVal_previous)
        {
            diffVal = timVal - g_TimerVal_previous;
        }
        else
        {
            diffVal = (0xFFFF - g_TimerVal_previous) + timVal;
        }

        IrRxQueue_EnQueue(diffVal);
	#if 0		// for debug
        UART1_PRINTF("IR-RX, TIM-Val: %d, Diff: %d\r\n", timVal, diffVal);
	#endif

        g_TimerVal_previous = timVal;        
        
        EXTI_ClearITPendingBit(EXTI_Line0);

        

    }  
}
void EXTI2_IRQHandler(void)
{

    uint16_t timVal, diffVal;
    
    if(EXTI_GetITStatus(EXTI_Line2) != RESET) {

        UART1_PRINTF("TEST 2\r\n");

        
        EXTI_ClearITPendingBit(EXTI_Line2);
    }  
}
void EXTI4_IRQHandler(void)
{

    uint16_t timVal, diffVal;
    
    if(EXTI_GetITStatus(EXTI_Line4) != RESET) {

        UART1_PRINTF("TEST 4\r\n");

        
        EXTI_ClearITPendingBit(EXTI_Line4);
    }  
}

uint16_t tick=0;
uint16_t toggle_led_1s=0;

void PI5008K_LED_TOGGLE(void)
{
	// 1 sec led toggle
	if ((tick%100000)==0)  
	{
		toggle_led_1s++;
		if(toggle_led_1s%2==0)
		{ 
			if( g_error_flg == OK_CODE){
				 GPIO_WriteBit(PORT_LED, G_LED, Bit_SET);  
				 GPIO_WriteBit(PORT_LED, R_LED, Bit_RESET); 
			}else{
			   GPIO_WriteBit(PORT_LED, R_LED, Bit_SET);
				 GPIO_WriteBit(PORT_LED, G_LED, Bit_RESET);
			}
				toggle_led_1s=0;
		}
		else
		{
			if( g_error_flg == OK_CODE){
				 GPIO_WriteBit(PORT_LED, G_LED, Bit_RESET);  
			}else{
			   GPIO_WriteBit(PORT_LED, R_LED, Bit_RESET);
			}
	
		}
	}


}




void TIM4_IRQHandler(void) //10us timer
{ 
	if(TIM_GetITStatus(TIM4, TIM_IT_Update) == SET) 
	{
		TIM_ClearITPendingBit(TIM4, TIM_IT_Update);
//		TimeService_10ms();
//		Check_Timer();
		tick++;
		cnt_10us++;
		if((cnt_10us%10)==0) cnt_100us++;
		if((cnt_100us%10)==0) cnt_1ms++;
		//if((cnt_1ms%1000)==0) cnt_1s++;

		PI5008K_LED_TOGGLE();



		/* To distinguish between longkey and normal keystrokes.*/
		if(g_old_KeyVal)
		{
			 if(g_repeat_cnt!=g_repeat_cnt_prv)
			{
				g_input_key_flag=0;
				g_start_key_tim=0;
				g_repeat_cnt_prv=g_repeat_cnt;
				//UART1_PRINTF("refresh g_repeat_cnt %d\r\n", g_repeat_cnt);
			}

			if(g_start_key_tim>=IR_KEY_REPEAT_TERM)
			{
				if(g_repeat_cnt>=10)
				{
					g_long_key_flag=1;

					//g_old_KeyVal = 0;
					g_start_key_tim = 0;
					g_input_key_flag=0;
					g_repeat_cnt=0;
					g_repeat_cnt_prv=0;
				}
				else
				{
					UART1_PRINTF("refresh g_repeat_cnt %d\r\n", g_repeat_cnt);
					g_input_key_flag=1;

					g_long_key_flag=0;
					//g_old_KeyVal = 0;
					g_start_key_tim = 0;
					g_repeat_cnt=0;
					g_repeat_cnt_prv=0;

					

				}
			}
			else
			{
				g_start_key_tim++;
			}

		}


	}
}

unsigned int jogkey_cnt;
unsigned int jogkey_pre_cnt;
unsigned int jogkey_cur_val;
int PI5008K_5Dir_Key_Read(void)
{
	
	if(GPIO_ReadInputDataBit(GPIOC,GPIO_Pin_14)==0x00)
	{
		jogkey_cur_val=1;
		jogkey_cnt++;
		jogkey_pre_cnt=jogkey_cnt;
	}
	else if(GPIO_ReadInputDataBit(GPIOA,GPIO_Pin_1)==0x00)
	{	
		jogkey_cur_val=2;
		jogkey_cnt++;
		jogkey_pre_cnt=jogkey_cnt;
	}
	else if(GPIO_ReadInputDataBit(GPIOC,GPIO_Pin_13)==0x00)
	{
		jogkey_cur_val=3;
		jogkey_cnt++;
		jogkey_pre_cnt=jogkey_cnt;

	}
	else if(GPIO_ReadInputDataBit(GPIOC,GPIO_Pin_15)==0x00)
	{
		jogkey_cur_val=4;
		jogkey_cnt++;
		jogkey_pre_cnt=jogkey_cnt;

	}
	else if(GPIO_ReadInputDataBit(GPIOB,GPIO_Pin_1)==0x00)
	{
		jogkey_cur_val=5;
		jogkey_cnt++;
		jogkey_pre_cnt=jogkey_cnt;

	}
	else
	{
		if(jogkey_cur_val)
		{
			if(jogkey_cnt == jogkey_pre_cnt)
			{
				if(jogkey_cur_val==1)
				{
					UART1_PRINTF("LEFT\r\n");
					PI5008K_Uart_Con_Remote_Cmd(REM_DIR_LEFT);

#if 0
                    //TEST aging...
                    {
                        UART1_PRINTF("Loop test. delayms\r\n");
                        while(1)
                        {
                            int i = 0;
                            int delayms = 10;
                            UART1_PRINTF("Loop test. delayms(%d), cnt(%d)\r\n", delayms, i++);
                            Delay_ms(delayms);
                            PI5008K_Uart_Con_Remote_Cmd(REM_DIR_LEFT);
                            Delay_ms(delayms);
                            PI5008K_Uart_Con_Remote_Cmd(REM_DIR_RIGHT);
                            Delay_ms(delayms);
                            PI5008K_Uart_Con_Remote_Cmd(REM_DIR_UP);
                            Delay_ms(delayms);
                            PI5008K_Uart_Con_Remote_Cmd(REM_DIR_DOWN);
                            Delay_ms(delayms);
                        }
                    }
#endif
                }
                else if(jogkey_cur_val==2)
                {
                    UART1_PRINTF("RIGHT\r\n");
                    PI5008K_Uart_Con_Remote_Cmd(REM_DIR_RIGHT);
#if 0
                    //TEST aging...
                    {
                        UART1_PRINTF("Loop test. No delayms\r\n");
                        while(1)
                        {
                            PI5008K_Uart_Con_Remote_Cmd(REM_DIR_LEFT);
                            PI5008K_Uart_Con_Remote_Cmd(REM_DIR_RIGHT);
                            PI5008K_Uart_Con_Remote_Cmd(REM_DIR_UP);
                            PI5008K_Uart_Con_Remote_Cmd(REM_DIR_DOWN);
                        }
                    }
#endif
				}
				else if(jogkey_cur_val==3)
				{
					UART1_PRINTF("UP\r\n");
					PI5008K_Uart_Con_Remote_Cmd(REM_DIR_UP);
				}
				else if(jogkey_cur_val==4)
				{
					UART1_PRINTF("DOWN\r\n");
					PI5008K_Uart_Con_Remote_Cmd(REM_DIR_DOWN);
				}
				else if(jogkey_cur_val==5)
				{
					if(jogkey_cnt>=100000)
					{
						UART1_PRINTF("LONG CENTER\r\n");
						PI5008K_Uart_Con_Remote_Cmd(REM_MENU);

                        if(g_center_key_flag == 0)
                        {
                            g_center_key_flag = 1;
                        }
					}
					else
					{
						UART1_PRINTF("CENTER\r\n");
						PI5008K_Uart_Con_Remote_Cmd(REM_DIR_CENTER);

                        if(g_center_key_flag == 0)
                        {
                            g_center_key_flag = 1;
                        }
                    }
				}
		
				jogkey_cnt=0;
				jogkey_pre_cnt=0;
				jogkey_cur_val=0;
			}
		}

