sentervip/stm32f103-bootloader-Demo/stm32f105rb-IAP/pixelplus_stm32/PI5008K/pi5008k_func.c
	}






	
    return(0);
}

int g_flag_capture_status = 0; //0:idle(end), 1:start, 2:processing

int PI5008K_5Dir_Center_Key_Led(void)
{
	int PI5008K_MCU_CON0 = 0, PI5008K_MCU_CON1 = 0;

	PI5008K_MCU_CON0 = GPIO_ReadInputDataBit(GPIOB,GPIO_Pin_10);
	PI5008K_MCU_CON1 = GPIO_ReadInputDataBit(GPIOB,GPIO_Pin_11);

    //UART1_PRINTF("S:%d, MCUCON:%d_%d\r\n", g_flag_capture_status, PI5008K_MCU_CON1, PI5008K_MCU_CON0);
    switch(g_flag_capture_status)
    {
        case 0: //0:idle(end), 1:start, 2:processing
            {
                if(g_center_key_flag & !PI5008K_MCU_CON0) //capture start
                {
                    UART1_PRINTF("cap idle->start\r\n");
                    g_flag_capture_status = 1; //0:idle(end), 1:start, 2:processing
                }
                break;
            }
        case 1: //0:idle(end), 1:start, 2:processing
            {
                if(g_center_key_flag & PI5008K_MCU_CON0) //capture start
                {
                    UART1_PRINTF("cap start->ing(led on)\r\n");
                    g_flag_capture_status = 2; //0:idle(end), 1:start, 2:processing
                    GPIO_WriteBit(GPIOB, GPIO_Pin_8, Bit_RESET); //Led1 on
                }
                break;
            }
        case 2: //0:idle(end), 1:start, 2:processing
            {
                if(g_center_key_flag & !PI5008K_MCU_CON0)
                {
                    UART1_PRINTF("cap ing->idle(led off)\r\n");
                    g_flag_capture_status = 0; //0:idle(end), 1:start, 2:processing
                    g_center_key_flag = 0;
                    GPIO_WriteBit(GPIOB, GPIO_Pin_8, Bit_SET); //Led1 off
                }
                break;
            }
        default:
            {
                g_flag_capture_status = 0; //0:idle(end), 1:start, 2:processing
                g_center_key_flag = 0;
                GPIO_WriteBit(GPIOB, GPIO_Pin_8, Bit_SET); //Led1 off
                break;
            }
    }

    return(0);
}

//////////////////////////////////////////////////////////////////////////////////////////////////////
